####
## SETUP
####
tap "homebrew/cask"
cask_args appdir: "/Applications"

####
## CLI UTILS
####
brew "git"
brew "jq"

####
## DEVELOPMENT
####
cask "visual-studio-code"
cask "docker"
cask "warp"
brew "vim"
brew "nvm"
brew "terragrunt"
brew "rbenv"
brew "ruby-build"
brew "terraform"
brew "terraform-docs"
brew "libpq"
brew "asdf"

####
## K8s
####
brew "helm"
brew "kubernetes-cli"
brew "kubeseal"
brew "kustomize"
brew "k9s"
brew "derailed/popeye/popeye"
brew "krew"
brew "k3d"
brew "kubeval"
brew "kubevela"

####
## SYSTEM UTILS
####
brew "ag"                 # The Silver Searcher
brew "rg"                 # The Silver Searcher
brew "git-delta"              # Ripgrep
brew "ffmpeg"             # Video Processing
brew "htop"
brew "tldr"               # Human readable `man` alternative
brew "tmux"
cask "tunnelblick"        # OpenVPN Client
brew "trash"              # send to trash instead of traditional `rm`
brew "watch"
brew "wget"

####
## DESKTOP APPS
####
cask "doxie"          # Paperless Scanning App
cask "authy"
cask "spotify"
cask "notion"
cask "slack"
cask "iterm2"
cask "zoom"

## Utilities
cask "alfred"           # Spotlight replacement
cask "rectangle"        # Window Management
cask "caffeine"         # Keep computer awake
brew "wireguard-tools"  # Wireguard VPN Client
cask "mos"              # Better mouse preferences
